[
  {
    "imageUrl": "partnerPortal.png",
    "alt": "PartnerPortal",
    "title": "PartnerPortal",
    "description": "Built a .NET Blazor app from scratch to automate data processing and reduce manual work for GTT Automotive. Dealers and suppliers access vehicle data through a custom login, while admins validate data via Microsoft login. The app is designed for scalability, strong security, and a smooth user experience. This project gave me hands-on experience with .NET Blazor in a professional setting.",
    "url": null,
    "technologies": [
      ".Net Blazor",
      "C#",
      "Bootstrap",
      "Entity Framework",
      "SQL",
      "API",
      "MSAL",
      "Azure DevOps"
    ]
  },
  {
    "imageUrl": "paintballhappening.jpg",
    "alt": "paintballHappening",
    "title": "PaintballHappening website",
    "description": "in team of 4 we worked out a new website for paintball happening a kmo. The goal was to find a small kmo to help. We made a website with a reservation system, and a payment system. The website is made with wordpress and plugins. The newly made website is user friendly and easy to maintain for the owner. I made a couple pages and always did my time due to the deadline we made for the project.",
    "url": null,
    "technologies": ["Wordpress", "HTML", "CSS"]
  },
  {
    "imageUrl": "cookBook.png",
    "alt": "cookBook",
    "title": "Full stack web/mobile application CookBook",
    "description": "A cross-platform recipe manager built with Next.js, Prisma, and React Native. Secure authentication using cookies (web) and Secure Storage (mobile). Efficient data fetching with TanStack Query and scalable backend via Vercel & NeonDB. Focused on performance, security, and a seamless user experience.",
    "url": null,
    "technologies": [
      "NextJs",
      "Prisma",
      "React Native",
      "Android studio",
      "Vercel",
      "Tanstack query",
      "Docker",
      "Tailwind",
      "PostgreSQL"
    ]
  },
  {
    "imageUrl": null,
    "alt": null,
    "title": "Youth travel app",
    "description": "In a team of 5, we developed a travel app for youth, focusing on user-friendliness and a modern design. I was responsible for the backend, creating a REST API with .NET Core and Entity Framework. The app allows users to create an account, log in, and manage their travel plans. We used Agile methodology for efficient collaboration and timely delivery. The application allows an organization to manage trips, monitors, activities, photos, etc. The app offers both members and non-members the opportunity to easily register for trips. This project taught me how to work effectively in a team. Using Scrum, standups, and good planning helped us manage time well and write efficient code during sprints. Our collaboration resulted in a well-functioning application.",
    "url": null,
    "technologies": [
      ".Net MVC",
      "C#",
      "Entity Framework",
      "SQL",
      "API",
      "HTML",
      "CSS",
      "Bootstrap",
      "JavaScript"
    ]
  },

  {
    "imageUrl": "mauiWedstrijden.png",
    "alt": null,
    "title": "Maui match application",
    "description": "In a team of 2, We worked on a .Net Maui applicatin, we had to add 5 features each to the application. I did debugging as there were some bugs in the application. Also i made it possible to receive, create, delete, update a match / matches from the database by creating repository's and models. I also added a extra page where i got data from a api and displayed it in a list. here i used a deserializer to convert the json data to a model. ",
    "url": null,
    "technologies": [".Net MAUI", "C#", "XAML", "SQL", "API"]
  },
  {
    "imageUrl": null,
    "alt": null,
    "title": "Astro Development & Playwright Testing",
    "description": "Set up an Astro frontend with FlowBite styling, integrated scraped data using Puppeteer, and wrote E2E tests with Playwright. Deployed via GitHub Actions to Combell.",
    "url": null,
    "technologies": [
      "Astro",
      "Puppeteer",
      "Playwright",
      "FlowBite",
      "GitHub Actions",
      "CI/CD"
    ]
  },
  {
    "imageUrl": null,
    "alt": null,
    "title": "Puppeteer Web Scraping",
    "description": "Scraped product data from Coolblue using Puppeteer, applied filters, cleaned data, and saved structured JSON files. Included a personal project scraping weather forecasts.",
    "url": null,
    "technologies": ["Puppeteer", "JavaScript", "JSON", "Data Cleaning"]
  },
  {
    "imageUrl": null,
    "alt": null,
    "title": "C# Bugfixing Project",
    "description": "Fixed 20 bugs in a C# app involving syntax, logic, and runtime issues. Practiced pair programming and worked with an existing codebase.",
    "url": null,
    "technologies": ["C#", "Debugging", "Pair Programming"]
  },
  {
    "imageUrl": null,
    "alt": null,
    "title": "Holiday Park Modeling",
    "description": "Designed ERD and MongoDB schema for a fictional holiday park. Focused on data modeling and complex relationships.",
    "url": null,
    "technologies": ["MongoDB", "ERD", "Database Design"]
  },
  {
    "imageUrl": null,
    "alt": null,
    "title": "First JavaScript Website",
    "description": "Built a basic responsive site using HTML and CSS. Learned layout, selectors, and responsive design principles.",
    "url": null,
    "technologies": ["HTML", "CSS", "Responsive Design"]
  },
  {
    "imageUrl": null,
    "alt": null,
    "title": "JavaScript Task Manager",
    "description": "Created a dynamic task list app using advanced JS features like DOM manipulation, AJAX, and local storage.",
    "url": null,
    "technologies": ["JavaScript", "DOM", "AJAX", "LocalStorage"]
  },
  {
    "imageUrl": null,
    "alt": null,
    "title": "User Registration Form",
    "description": "Built a dynamic form with dark mode, real-time validation, and conditional dropdowns. Used JS and Bootstrap.",
    "url": null,
    "technologies": ["JavaScript", "Bootstrap", "Form Validation"]
  },
  {
    "imageUrl": null,
    "alt": null,
    "title": "SportFusion Camp Modernization",
    "description": "Redesigned an old website using Bootstrap for a modern, responsive look. Maintained original content structure.",
    "url": null,
    "technologies": ["Bootstrap", "HTML", "CSS", "Responsive Design"]
  }
]
